USER_AGENT = [
    "Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_6_8; en-us) AppleWebKit/534.50 (KHTML, like Gecko) Version/5.1 Safari/534.50",
    "Mozilla/5.0 (Windows; U; Windows NT 6.1; en-us) AppleWebKit/534.50 (KHTML, like Gecko) Version/5.1 Safari/534.50",
    "Mozilla/5.0 (Windows NT 10.0; WOW64; rv:38.0) Gecko/20100101 Firefox/38.0",
    "Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; .NET4.0C; .NET4.0E; .NET CLR 2.0.50727; .NET CLR 3.0.30729; .NET CLR 3.5.30729; InfoPath.3; rv:11.0) like Gecko",
    "Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)",
    "Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.0; Trident/4.0)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0)",
    "Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)",
    "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.6; rv:2.0.1) Gecko/20100101 Firefox/4.0.1",
    "Mozilla/5.0 (Windows NT 6.1; rv:2.0.1) Gecko/20100101 Firefox/4.0.1",
    "Opera/9.80 (Macintosh; Intel Mac OS X 10.6.8; U; en) Presto/2.8.131 Version/11.11",
    "Opera/9.80 (Windows NT 6.1; U; en) Presto/2.8.131 Version/11.11",
    "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_7_0) AppleWebKit/535.11 (KHTML, like Gecko) Chrome/17.0.963.56 Safari/535.11",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Maxthon 2.0)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; TencentTraveler 4.0)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; The World)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Trident/4.0; SE 2.X MetaSr 1.0; SE 2.X MetaSr 1.0; .NET CLR 2.0.50727; SE 2.X MetaSr 1.0)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; 360SE)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Avant Browser)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1)",
    "Mozilla/5.0 (iPhone; U; CPU iPhone OS 4_3_3 like Mac OS X; en-us) AppleWebKit/533.17.9 (KHTML, like Gecko) Version/5.0.2 Mobile/8J2 Safari/6533.18.5",
    "Mozilla/5.0 (iPod; U; CPU iPhone OS 4_3_3 like Mac OS X; en-us) AppleWebKit/533.17.9 (KHTML, like Gecko) Version/5.0.2 Mobile/8J2 Safari/6533.18.5",
    "Mozilla/5.0 (iPad; U; CPU OS 4_3_3 like Mac OS X; en-us) AppleWebKit/533.17.9 (KHTML, like Gecko) Version/5.0.2 Mobile/8J2 Safari/6533.18.5",
    "Mozilla/5.0 (Linux; U; Android 2.3.7; en-us; Nexus One Build/FRF91) AppleWebKit/533.1 (KHTML, like Gecko) Version/4.0 Mobile Safari/533.1",
    "MQQBrowser/26 Mozilla/5.0 (Linux; U; Android 2.3.7; zh-cn; MB200 Build/GRJ22; CyanogenMod-7) AppleWebKit/533.1 (KHTML, like Gecko) Version/4.0 Mobile Safari/533.1",
    "Opera/9.80 (Android 2.3.4; Linux; Opera Mobi/build-1107180945; U; en-GB) Presto/2.8.149 Version/11.10",
    "Mozilla/5.0 (Linux; U; Android 3.0; en-us; Xoom Build/HRI39) AppleWebKit/534.13 (KHTML, like Gecko) Version/4.0 Safari/534.13",
    "Mozilla/5.0 (BlackBerry; U; BlackBerry 9800; en) AppleWebKit/534.1+ (KHTML, like Gecko) Version/6.0.0.337 Mobile Safari/534.1+",
    "Mozilla/5.0 (hp-tablet; Linux; hpwOS/3.0.0; U; en-US) AppleWebKit/534.6 (KHTML, like Gecko) wOSBrowser/233.70 Safari/534.6 TouchPad/1.0",
    "Mozilla/5.0 (SymbianOS/9.4; Series60/5.0 NokiaN97-1/20.0.019; Profile/MIDP-2.1 Configuration/CLDC-1.1) AppleWebKit/525 (KHTML, like Gecko) BrowserNG/7.1.18124",
    "Mozilla/5.0 (compatible; MSIE 9.0; Windows Phone OS 7.5; Trident/5.0; IEMobile/9.0; HTC; Titan)",
    "UCWEB7.0.2.37/28/999",
    "NOKIA5700/ UCWEB7.0.2.37/28/999",
    "Openwave/ UCWEB7.0.2.37/28/999",
    "Mozilla/4.0 (compatible; MSIE 6.0; ) Opera/UCWEB7.0.2.37/28/999",
    "Mozilla/6.0 (iPhone; CPU iPhone OS 8_0 like Mac OS X) AppleWebKit/536.26 (KHTML, like Gecko) Version/8.0 Mobile/10A5376e Safari/8536.25",

]

CITIES_CODE = {
    '直辖市': {'北京': 110000, '天津': 120000, '上海': 310000, '重庆': 500000},
    '福建': {'福州': 350100, '龙岩': 350800, '南平': 350700, '宁德': 350900, '莆田': 350300, '泉州': 350500, '三明': 350400,
           '厦门': 350200, '漳州': 350600},
    '安徽': {'合肥': 340100, '安庆': 340800, '蚌埠': 340300, '亳州': 341600, '池州': 341700, '滁州': 341100, '阜阳': 341200,
           '淮北': 340600, '黄山': 341000, '六安': 341500, '马鞍山': 340500, '宿州': 341300, '铜陵': 340700, '芜湖': 340200,
           '宣城': 341800, '淮南': 340400}
    , '广东': {'广州': 440100, '潮州': 445100, '东莞': 441900, '佛山': 440600, '河源': 441600, '惠州': 441300, '江门': 440700,
             '揭阳': 445200, '茂名': 440900, '梅州': 441400, '清远': 441800, '汕头': 440500, '汕尾': 441500, '韶关': 440200,
             '深圳': 440300, '阳江': 441700, '云浮': 445300, '湛江': 440800, '肇庆': 441200, '中山': 442000, '珠海': 440400}
    , '广西': {'南宁': 450100, '百色': 451000, '北海': 450500, '崇左': 451400, '防城港': 450600, '桂林': 450300, '贵港': 450800,
             '河池': 451200, '贺州': 451100, '来宾': 451300, '柳州': 450200, '钦州': 450700, '梧州': 450400, '玉林': 450900}
    , '贵州': {'贵阳': 520100, '安顺': 520400, '毕节': 520500, '六盘水': 520200, '铜仁': 520600, '遵义': 520300}
    , '甘肃': {'兰州': 620100, '白银': 620400, '定西': 621100, '甘南州': 623000, '嘉峪关': 620200, '金昌': 620300, '酒泉': 620900,
             '临夏州': 622900, '陇南': 621200, '平凉': 620800, '庆阳': 621000, '天水': 620500, '武威': 620600, '张掖': 620700}
    , '海南': {'海口': 460100, '白沙黎族自治县': 469025, '保亭黎族苗族自治县': 469029, '昌江黎族自治县': 469026, '儋州': 469003, '澄迈': 469023,
             '东方': 469007, '定安': 469021, '琼海': 469002, '琼中黎族苗族自治县': 469030, '乐东黎族自治县': 469027, '临高': 469024,
             '陵水黎族自治县': 469028, '三亚': 460200, '屯昌': 469022, '万宁': 469006, '文昌': 469005, '五指山': 469001, '三沙': 460300}
    , '河南': {'郑州': 410100, '安阳': 410500, '鹤壁': 410600, '焦作': 410800, '开封': 410200, '洛阳': 410300, '漯河': 411100,
             '南阳': 411300, '平顶山': 410400, '濮阳': 410900, '三门峡': 411200, '商丘': 411400, '新乡': 410700, '信阳': 411500,
             '许昌': 411000, '周口': 411600, '驻马店': 411700, '济源': 419001}
    , '黑龙江': {'哈尔滨': 230100, '大庆': 230600, '大兴安岭地区': 232700, '鹤岗': 230400, '黑河': 231100, '鸡西': 230300,
              '佳木斯': 230800, '牡丹江': 231000, '七台河': 230900, '齐齐哈尔': 230200, '双鸭山': 230500, '绥化': 231200,
              '伊春': 230700}
    , '湖北': {'武汉': 420100, '鄂州': 420700, '恩施': 422800, '黄冈': 421100, '黄石': 420200, '荆门': 420800, '荆州': 421000,
             '潜江': 429005, '神农架地区': 429021, '十堰': 420300, '随州': 421300, '天门': 429006, '仙桃': 429004, '咸宁': 421200,
             '襄阳': 420600, '孝感': 420900, '宜昌': 420500}
    , '湖南': {'长沙': 430100, '常德': 430700, '郴州': 431000, '衡阳': 430400, '怀化': 431200, '娄底': 431300, '邵阳': 430500,
             '湘潭': 430300, '湘西州': 433100, '益阳': 430900, '永州': 431100, '岳阳': 430600, '张家界': 430800, '株洲': 430200}
    , '河北': {'石家庄': 130100, '保定': 130600, '沧州': 130900, '承德': 130800, '邯郸': 130400, '衡水': 131100, '廊坊': 131000,
             '秦皇岛': 130300, '唐山': 130200, '邢台': 130500, '张家口': 1307}
    , '江苏': {'南京': 320100, '常州': 320400, '淮安': 320800, '连云港': 320700, '南通': 320600, '苏州': 320500, '宿迁': 321300,
             '泰州': 321200, '无锡': 320200, '徐州': 320300, '盐城': 320900, '扬州': 321000, '镇江': 321100}
    , '江西': {'南昌': 360100, '抚州': 361000, '赣州': 360700, '吉安': 360800, '景德镇': 360200, '九江': 360400, '萍乡': 360300,
             '上饶': 361100, '新余': 360500, '宜春': 360900, '鹰潭': 360600}
    , '吉林': {'长春': 220100, '白城': 220800, '白山': 220600, '吉林市': 220200, '辽源': 220400, '四平': 220300, '松原': 220700,
             '通化': 220500, '延边': 222400}
    , '辽宁': {'沈阳': 210100, '鞍山': 2103, '本溪': 210500, '朝阳': 211300, '大连': 210200, '丹东': 210600, '抚顺': 210400,
             '阜新': 210900, '葫芦岛': 211400, '锦州': 210700, '辽阳': 211000, '盘锦': 211100, '铁岭': 211200, '营口': 210800}
    , '宁夏': {'银川': 640100, '固原': 640400, '石嘴山': 640200, '吴忠': 640300, '中卫': 640500}
    , '内蒙古': {'呼和浩特': 150100, '阿拉善盟': 152900, '包头': 150200, '巴彦淖尔': 150800, '赤峰': 150400, '鄂尔多斯': 150600,
              '呼伦贝尔': 150700, '通辽': 150500, '乌海': 150300, '乌兰察布': 150900, '锡林郭勒盟': 152500, '兴安盟': 152200}
    , '青海': {'西宁': 630100, '果洛州': 632600, '海东地区': 632100, '海北州': 632200, '海南州': 632500, '海西州': 632800,
             '黄南州': 632300, '玉树州': 632700}
    , '山东': {'济南': 370100, '滨州': 371600, '东营': 370500, '德州': 371400, '菏泽': 371700, '济宁': 370800, '聊城': 371500,
             '临沂': 371300, '青岛': 70200, '日照': 371100, '泰安': 370900, '威海': 371000, '潍坊': 370700, '烟台': 370600,
             '枣庄': 370400, '淄博': 370300}
    , '山西': {'太原': 140100, '长治': 140400, '大同': 140200, '晋城': 140500, '晋中': 140700, '临汾': 141000, '吕梁': 141100,
             '朔州': 140600, '忻州': 140900, '阳泉': 140300, '运城': 1408}
    , '陕西': {'西安': 610100, '安康': 610900, '宝鸡': 610300, '汉中': 610700, '商洛': 611000, '铜川': 610200, '渭南': 610500,
             '咸阳': 610400, '延安': 610600, '榆林': 610800}
    , '四川': {'成都': 510100, '阿坝州': 513200, '巴中': 511900, '达州': 511700, '德阳': 510600, '甘孜州': 513300, '广安': 511600,
             '广元': 510800, '乐山': 511100, '凉山州': 513400, '泸州': 510500, '南充': 511300, '眉山': 511400, '绵阳': 510700,
             '内江': 511000, '攀枝花': 510400, '遂宁': 510900, '雅安': 511800, '宜宾': 511500, '资阳': 512000, '自贡': 510300}
    , '西藏': {'拉萨': 540100, '阿里地区': 542500, '昌都地区': 542100, '林芝地区': 542600, '那曲地区': 542400, '日喀则地区': 542300,
             '山南地区': 542200}
    , '新疆': {'乌鲁木齐': 650100, '阿拉尔': 659002, '阿克苏地区': 652900, '阿勒泰地区': 654300, '巴音郭楞蒙古自治州': 652800, '博尔塔拉州': 652700,
             '昌吉州': 652300, '哈密地区': 652200, '和田地区': 653200, '喀什地区': 653100, '克拉玛依': 650200, '克孜勒苏州': 653000,
             '石河子': 659001, '塔城地区': 654200, '图木舒克': 659003, '吐鲁番地区': 652100, '五家渠': 659004, '伊犁州': 654000,
             '北屯': 659005, '铁门关': 659006, '双河': 659007, '可克达拉': 659008, '昆玉': 659009}
    , '云南': {'昆明': 530100, '保山': 530500, '楚雄州': 532300, '大理州': 532900, '德宏州': 533100, '迪庆州': 533400, '红河州': 532500,
             '丽江': 530700, '临沧': 530900, '怒江州': 533300, '普洱': 530800, '曲靖': 530300, '昭通': 530600, '文山': 532600,
             '西双版纳傣族自治州': 532800, '玉溪': 530400}
    , '浙江': {'杭州': 330100, '湖州': 330500, '嘉兴': 330400, '金华': 330700, '丽水': 331100, '宁波': 330200, '衢州': 330800,
             '绍兴': 330600, '台州': 331000, '温州': 330300, '舟山': 330900}
}

# failed last 咸宁


AIRPORT_CODE = {'北京': ('PEK', 'PKX'),  '上海': ('SHA', 'PVG'),
                '舟山': 'HSN', '张家口': 'ZQZ', '承德': 'CDE', '霍林郭勒': 'HUO', '牡丹江': 'MDG', '延吉': 'YNJ',
                '深圳': 'SZX', '扬州': 'YTY', '赣州': 'KOW', '广州': 'CAN', '锦州': 'JNZ', '黄山': 'TXN', '且末': 'IQM', '昌都': 'BPX',
                '神农架': 'HPG', '石河子': 'SHF', '揭阳': 'SWA', '遵义': 'ZYI', '松原': 'YSQ', '澎湖列岛': 'MZG', '九江': 'JIU',
                '普洱': 'SYM', '河池': 'HCJ', '稻城': 'DCY', '泰州': 'YTY', '临沂': 'LYI', '阿尔山': 'YIE', '贵阳': 'KWE', '日照': 'RIZ',
                '威海': 'WEH', '中卫': 'ZHY', '咸阳': 'SIA', '石家庄': 'SJW', '大同': 'DAT', '邯郸': 'HDG', '呼伦贝尔': 'XRQ',
                '嘉峪关': 'JGN', '拉萨': 'LXA', '榆林': 'UYN', '伊宁': 'YIN', '安庆': 'AQG', '石狮': 'JJN', '昭通': 'ZAT',
                '井冈山': 'JGS', '红原': 'AHJ', '林芝': 'LZY', '柳州': 'LZH', '达州': 'DAX', '达县': 'DAX', '库尔勒': 'KRL',
                '西宁': 'XNN', '凯里': 'KJH', '黑河': 'HEK', '宁蒗': 'NLH', '额济纳旗': 'EJN', '吐鲁番': 'TLQ', '潮汕': 'SWA',
                '连云港': 'LYG', '海口': 'HAK', '忻州': 'WUT', '晋江': 'JJN', '白山': 'NBS', '桂林': 'KWL', '丽江': 'LJG', '芷江': 'HJJ',
                '潍坊': 'WEF', '万州': 'WXN', '盐城': 'YNZ', '若羌': 'RQA', '泸州': 'LZO', '康定': 'KGT', '青岛': 'TAO', '梅县': 'MXZ',
                '漠河': 'OHE', '文山': 'WNH', '高雄': 'KHH', '上饶': 'SQD', '杭州': 'HGH', '塔城': 'TCG', '西安': 'SIA', '台东': 'TTT',
                '黎平': 'HZH', '陇南': 'LNL', '攀枝花': 'PZI', '珠海': 'ZUH', '徐州': 'XUZ', '张掖': 'YZY', '邵阳': 'WGN', '金昌': 'JIC',
                '遵义茅台': 'WMT', '唐山': 'TVS', '南京': 'NKG', '南宁': 'NNG', '巴彦淖尔': 'RLK', '怀化': 'HJJ', '十堰': 'WDS',
                '海拉尔': 'HLD', '福州': 'FOC', '哈密': 'HMI', '梧州': 'WUZ', '临沧': 'LNJ', '宁波': 'NGB',
                '昆明': 'KMG', '布尔津': 'KJI', '济宁': 'JNG', '鸡西': 'JXA', '乌兰浩特': 'HLH', '祁连': 'HBQ', '西昌': 'XIC',
                '大庆': 'DQA', '汉中': 'HZG', '六盘水': 'LPF', '洛阳': 'LYA', '南竿': 'LZN', '襄阳': 'XFN', '荆门': 'JM1', '绵阳': 'MIG',
                '二连浩特': 'ERL', '阿勒泰': 'AAT', '腾冲': 'TCZ', '信阳': 'XAI', '琼海': 'BAR', '夏河': 'GXH', '阜阳': 'FUG',
                '满洲里': 'NZH', '泉州': 'JJN', '澜沧': 'JMJ', '沈阳': 'SHE', '广元': 'GYS', '阿里': 'NGQ', '郑州': 'CGO',
                '呼和浩特': 'HET', '九寨沟': 'JZH', '玉树': 'YUS', '兴义': 'ACX', '长沙': 'CSX', '延安': 'ENY', '无锡': 'WUX',
                '池州': 'JUH', '抚远': 'FYJ', '大理': 'DLU', '克拉玛依': 'KRY', '三亚': 'SYX', '富蕴': 'FYN', '乌鲁木齐': 'URC',
                '香格里拉': 'DIG', '宜宾': 'YBP', '大连': 'DLC', '张家界': 'DYG', '沧源': 'CWJ', '惠州': 'HUZ', '景德镇': 'JDZ',
                '芒市': 'LUM', '莎车': 'QSZ', '南充': 'NAO', '运城': 'YCU', '衡阳': 'HNY', '重庆': 'CKG', '连城': 'LCX', '南昌': 'KHN',
                '伊春': 'LDS', '五大连池': 'DTU', '龙岩': 'LCX', '保山': 'BSD', '澳门': 'MFM', '花土沟': 'HTT', '哈尔滨': 'HRB',
                '太原': 'TYN', '马祖': 'MFK', '阿拉善右旗': 'RHT', '成都': 'CTU', '长春': 'CGQ', '常州': 'CZX',
                '日喀则': 'RKZ', '包头': 'BAV', '乌拉特中旗': 'WZQ', '常德': 'CGD', '佳木斯': 'JMU', '庆阳': 'IQN', '兰州': 'LHW',
                '济南': 'TNA', '潮州': 'SWA', '固原': 'GYU', '衢州': 'JUZ', '吕梁': 'LLV', '伊犁': 'YIN', '台南': 'TNN', '百色': 'AEB',
                '南阳': 'NNY', '朝阳': 'CHG', '荔波': 'LLB', '西双版纳': 'JHG', '乌兰察布': 'UCB', '武汉': 'WUH', '天水': 'THQ',
                '齐齐哈尔': 'NDG', '新源': 'NLT', '鄂尔多斯': 'DSN', '营口': 'YKH', '阿拉善左旗': 'AXF', '和田': 'HTN', '银川': 'INC',
                '东营': 'DOY', '惠阳': 'HUZ', '通辽': 'TGO', '合肥': 'HFE', '安顺': 'AVA', '铜仁': 'TEN', '锡林浩特': 'XIL',
                '厦门': 'XMN', '恩施': 'ENH', '丹东': 'DDG', '果洛': 'GMQ', '德令哈': 'HXD', '北海': 'BHY', '汕头': 'SWA', '淮安': 'HIA',
                '建三江': 'JSJ', '台州': 'HYN', '温州': 'WNZ', '烟台': 'YNT', '湛江': 'ZHA', '长治': 'CIH', '加格达奇': 'JGD',
                '宜春': 'YIC', '香港': 'HKG', '嘉义': 'CYI', '通化': 'TNH', '黔江': 'JIQ', '金门': 'KNH',
                '喀什': 'KHG', '宜昌': 'YIH', '秦皇岛': 'BPE', '义乌': 'YIW', '花莲': 'HUN', '永州': 'LLF', '天津': 'TSN', '白城': 'DBC',
                '鞍山': 'AOG', '迪庆': 'DIG', '库车': 'KCA', '马公': 'MZG', '南通': 'NTG', '乌海': 'WUA', '博乐': 'BPL',
                '临汾': 'LFQ', '敦煌': 'DNH', '毕节': 'BFJ', '三明': 'SQJ', '景洪': 'JHG', '格尔木': 'GOQ',
                '台中': 'RMQ', '阿克苏': 'AKU', '武夷山': 'WUS', '梅州': 'MXZ', '台北': 'TPE', '赤峰': 'CIF', '德宏': 'LUM',
                '扎兰屯': 'NZL', '岳阳': 'YYA'}
